0/shell/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0/shell";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 1 -1 0 0 0 0 ];

internalField   uniform ( 0 0 0 );

boundaryField
{

    shell_external
    {
        type            noSlip;
//        type            fixedValue;
        value           uniform ( 0 0 0 );
//        type            empty;
    }

    shell_inlet
    {
        type            fixedValue;
        value           uniform ( 0 0.01 0 );
//        type            flowRateInletVelocity;
//        massFlowRate    0.13795;
//	extrapolateProfile  yes;
//        value           $internalField;

    }
    
    shell_outlet
    {
        type            zeroGradient;
//        type            inletOutlet;
//	inletValue      uniform (0 0 0);
//        value           $internalField;

    }

    
    shell_to_solid
    {
        type            noSlip;
        value           uniform ( 0 0 0 );
    }
}


// ************************************************************************* //
