0/solid/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/solid";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 2 -2 0 0 0 0 ];

internalField   uniform 0;

boundaryField
{


    shell_external
    {
        type            calculated;
        value           $internalField;
    }  

    solid_external
    {
        type            calculated;
        value           $internalField;
    }  

    solid_to_tube
    {
        type            calculated;
        value           $internalField;
    }    
    
     solid_to_shell
    {
        type            calculated;
        value           $internalField;
    }     
    
}


// ************************************************************************* //
